title: Suspicious PowerShell Download
logsource:
  product: windows
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - Invoke-WebRequest
      - DownloadString

condition: selection

level: high
